#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
data.archive_file.sre-grafana-lambda: Reading...
data.archive_file.sre-grafana-lambda: Read complete after 0s [id=a2be94c89c654067a8a307fe4dbad86fdcef1bd7]
aws_sqs_queue.dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/877118445951/sre-grafana-lambda-dlq]
aws_sns_topic.notification_topic: Refreshing state... [id=arn:aws:sns:eu-west-1:877118445951:sre-grafana-lambda-notifications]
aws_iam_role.sre-grafana-lambda-role: Refreshing state... [id=sre-grafana-lambda-role]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=sre-grafana-lambda-role-20230409011108552500000001]
aws_iam_role_policy_attachment.lambda_sqs_send: Refreshing state... [id=sre-grafana-lambda-role-20230409020614404700000001]
aws_cloudwatch_metric_alarm.dlq_alarm: Refreshing state... [id=sre-grafana-lambda-dlq-alarm]
aws_lambda_function.sre-grafana-lambda: Refreshing state... [id=lambda_handler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.sre-grafana-lambda must be replaced
-/+ resource "aws_lambda_function" "sre-grafana-lambda" {
      ~ arn                            = "arn:aws:lambda:eu-west-1:877118445951:function:lambda_handler" -> (known after apply)
      ~ function_name                  = "lambda_handler" -> "sre-grafana-lambda" # forces replacement
      ~ id                             = "lambda_handler" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:877118445951:function:lambda_handler/invocations" -> (known after apply)
      ~ last_modified                  = "2023-04-09T02:06:24.936+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-1:877118445951:function:lambda_handler:1" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "Y/D+1aWzwenQUcAT6+5sSByU2dUMzTU0F1bmWgpdiMI=" -> (known after apply)
      ~ source_code_size               = 258 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "1" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `infrastructure/terraform/main`, Workflow: `Plan Terraform Main`*